[
  {
    "date": "2019-09-09T00:00:00",
    "rooms": [
      {
        "id": 5960,
        "name": "Oreo",
        "sessions": [
          {
            "id": "97c02802-3078-42ee-814a-95fc32be9f1a",
            "title": "Checkin",
            "description": null,
            "startsAt": "2019-09-09T08:00:00",
            "endsAt": "2019-09-09T09:00:00",
            "isServiceSession": true,
            "isPlenumSession": false,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "723d8074-f67e-4f2a-b063-8af45fe9a5c5",
            "title": "Welcome Address",
            "description": "Greg Fawson, COO - DroidconGlobal\nFábio Pinho - Droidcon Lisbon organizer",
            "startsAt": "2019-09-09T09:00:00",
            "endsAt": "2019-09-09T09:10:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "143176",
            "title": "Back to the basics - You don't need to know it all",
            "description": "Let's be honest, It's freaking hard to keep up to date with all the latest libraries, APIs, architectures and trends that appear in the Android development world every now and then.\r\n\r\nAnd we, as professionals that care about the software we produce, try (and usually fail) at learning about everything. The more time we spend, the more we realize we only know a fraction of the total.\r\n\r\nShould we work harder? Stop sleeping at nights? Or maybe there's another way? What if we are putting our effort in the wrong direction?\r\n\r\nI'll talk about the stages that a developer can go through, and what's my point of view of a healthier relationship with software development.",
            "startsAt": "2019-09-09T09:10:00",
            "endsAt": "2019-09-09T09:50:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "70acc869-c1f3-4474-9750-dee1b2b9b59b",
                "name": "Antonio Leiva"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "4952e588-d759-485d-a1ff-416ce8376c48",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T09:50:00",
            "endsAt": "2019-09-09T10:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "121988",
            "title": "Faster builds on Android - from 2 minutes to 2 seconds",
            "description": "What does a developer do when a build takes 2 minutes? He gets bored and his mind starts to wander. Maybe he opens Reddit, Twitter orMedium or checks his emails. Switching context and multitasking kills productivity. Every developer needs fast feedback, so he can get jump into the flow state. Therefore, fast builds are essential for productive development. \r\n\r\nFirst, we take a look into Gradle Build Scans. There is no sense in accelerating your build without measuring and comparing the different outcomes. Gradle Build Scans help you to understand what happens during your build and which parts consume the most time. \r\n\r\nThen we continue with basic tips to tweak your build with Gradle. Most of those tips are quick wins, because they only require a simple change in the Gradle build settings. \r\n\r\nFinally, we take a look into how modularisation influences the build speed by an example. Doing it right you can change your business logic and run your tests in 2 seconds instead of 2 minutes.",
            "startsAt": "2019-09-09T10:00:00",
            "endsAt": "2019-09-09T10:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3190b56c-b4fc-46bf-8e34-e4b28af676e9",
                "name": "Philipp Hofmann"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "5bdf4964-8fce-4adc-9469-612607f8feee",
            "title": "Coffee Break",
            "description": null,
            "startsAt": "2019-09-09T10:40:00",
            "endsAt": "2019-09-09T11:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "133993",
            "title": "Structured Concurrency: Asynchronous shift in Kotlin",
            "description": "Before Kotlin Coroutines (async programming in Kotlin) was stable, they were launched in a way that made them difficult to maintain and track down. \r\n\r\nStructured Concurrency introduced changes to solve these problems but also involved an ideological shift in order to use them. \r\n\r\nIn this talk, you'll learn how to do async programming in Kotlin using Structured Concurrency principles covering topics such as launching coroutines, scopes, error handling and testing.",
            "startsAt": "2019-09-09T11:00:00",
            "endsAt": "2019-09-09T11:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b4cf78c9-623b-4b8f-b676-097fb7802668",
                "name": "Manuel Vivo"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "42f123ed-dc99-4175-b88b-521cf799201f",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T11:40:00",
            "endsAt": "2019-09-09T11:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "133175",
            "title": "Getting the most out of code review",
            "description": "Is your team not reviewing code? You should be! Does it feel like you could be getting more out of code reviews? Absolutely! Code reviews are severely underutilized.  Let me show you some approaches to get more value from code reviews for you and your team.  \r\n\r\nI will emphasize code review best practices starting with why you should be performing code reviews.  Some teams don't perform reviews and this is really hurting them in the long run. I will attempt to sell the review process and explain why it is fundamental to our roles as developers.  \r\n\r\nTeams that are performing reviews may feel burdened by doing so and see it as chore. This also is not ideal and I will dig a little deeper and discuss why we feel this way sometimes. What are the strategies to overcome this feeling? Is it possible to enjoy code review?\r\n\r\nAre there shortcuts to work more efficiently at reviewing code? Absolutely! Can some things be automated? What can't? Let me show you some great approaches to making the review process streamlined and efficient. ",
            "startsAt": "2019-09-09T11:50:00",
            "endsAt": "2019-09-09T12:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c1bf1c38-8e9f-48a8-83fe-8a30f676e1d5",
                "name": "Brian Plummer"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "36b1fe6d-ed3a-40f9-a712-3c5e5e622dcb",
            "title": "Lunch Break",
            "description": null,
            "startsAt": "2019-09-09T12:30:00",
            "endsAt": "2019-09-09T13:30:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "123016",
            "title": "Life is too short not to use ADB commands",
            "description": "ADB is a versatile command-line tool that lets you communicate with a device. The ADB command facilitates a variety of device actions, such as installing and debugging apps, and it provides access to a Unix shell that you can use to run a variety of commands on a device. It is maybe one of the most used tools by the Android developers, but it is for sure the less known.\r\n\r\nDo you want to learn the basic ADB commands or extends your knowledge with some advanced commands? Are you struggling with some bugs? Are you tired to perform some repetitive test? This talk is for you! You can make ADB works for you with automation and assist you to kill bugs. I spent weeks diving into the ADB commands for Sony Mobile and Motorola, and I learned helpful commands that will make your life easier.\r\n\r\nIt's time for me to share this with you! Here is an outline:\r\n- How does it work? \r\n- Brushing up some basics commands\r\n- Some ADB commands you may have never heard about\r\n- Identify bugs\r\n- Automation",
            "startsAt": "2019-09-09T13:30:00",
            "endsAt": "2019-09-09T14:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1ee57fa9-790a-4a61-a980-6ef301818aea",
                "name": "Zhenlei Ji"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "73504d0a-a0fd-4447-a24d-cfdefe8ed005",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T14:10:00",
            "endsAt": "2019-09-09T14:20:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "122647",
            "title": "Building Voice-First Android Apps",
            "description": "Thanks to the latest advancements in Machine Learning, we're now capable of interacting with machines through natural language. The age of voice assistants is here with Alexa, the Google Assistant and others. But, as an Android developer, what can I do on my existing app in relation to conversational features?\r\n\r\nWhen we think about developing features that are voice-forward, we think about existing voice assistants such as Alexa and the Google Assistant. What about the fully-capable computers that we have with us all the time, our smartphones? Some moments on our day to day lives are very well suited for voice interactions: while in a car or cooking for example. Let's not forget that voice interactions are extremely accessible, not only in a physical way (for people with dexterity or motion impediments) but also in a cognitive way (I think we all have a loved one in our lives that really struggles with technology, and people from some emerging countries have very limited access to computers and are not at ease with technology).\r\n\r\nIn this talk, I'll explain what integrations can be done on Android:\r\n- 1st-party solutions such as the SpeechRecognizer and TextToSpeech APIs\r\n- Other Google solutions such as ML Kit, TensorFlow and Dialogflow\r\n- 3rd-party solutions such as Porcupine, Snips, Amazon Lex, Snowboy and PocketSphinx\r\n- Integration with the Google Assistant via App Actions",
            "startsAt": "2019-09-09T14:20:00",
            "endsAt": "2019-09-09T15:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
                "name": "Elaine Dias Batista"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "a1dfb382-b356-4ed1-a153-d0da2916b34a",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T15:00:00",
            "endsAt": "2019-09-09T15:10:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "127892",
            "title": "Experimentation at scale: fuel your application’s growth through A/B testing",
            "description": "As an Android Engineer in the Lyft Growth’s team, my role is to develop features and pieces of infrastructure the will grow the audience of the app.\r\n\r\nIn this talk I want to cover:\r\n- A/B testing 101\r\n- How to implement an A/B testing framework (or integrate with existing an solution if you don’t want to build it from scratch)\r\n- Identify growth opportunities in your app (1. funnel definition, 2. funnel optimization)\r\n- Pitfalls of A/B testing:\r\n   - Statistical significance,\r\n   - Novelty effect,\r\n   - Overexposure / Underexposure,\r\n   - Proper targeting for the correct sample size \r\n\r\n\r\nThis talk targets: Android/iOS engineer interested in Growth but also potentially Product Managers and CEOs",
            "startsAt": "2019-09-09T15:10:00",
            "endsAt": "2019-09-09T15:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
                "name": "Thomas Ezan"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "9ff30066-3872-4361-ac81-ae0af4c60284",
            "title": "Coffee Break",
            "description": null,
            "startsAt": "2019-09-09T15:50:00",
            "endsAt": "2019-09-09T16:10:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "137303",
            "title": "Bye bye RxJava: Building flexible SDKs with Kotlin and Coroutines",
            "description": "We've made some mistakes building our client-facing SDKs over the last two years at Babylon Health.\r\n\r\nRxJava has been around in Android development for years, and we've learned a great deal about it. It's a powerful tool, but with great power comes great responsibility. And really - you should always use the right tool for the job, not the most \"powerful\" one. Now we have a new tool in our toolbox - Coroutines - and they seem better suited to a typical Android business layer. It doesn't mean RxJava should be entirely out of the window, as for us it's still quite useful on the UI layer.\r\n\r\nWe're here to share why and how we went from a heavily RxJava based SDK architecture to a more client and developer-friendly approach replacing most of our code with Kotlin & Coroutines and compare both solutions.\r\n\r\nWe will admit to mistakes, share the principles that guided us in our planning for fixing them and show you how we came up with a plan and executed it.",
            "startsAt": "2019-09-09T16:10:00",
            "endsAt": "2019-09-09T16:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4ecc4ff8-c63c-4b9e-927a-7c4094f5b8ea",
                "name": "Mikołaj Leszczyński"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "48cb48a2-62f7-4de2-9b2a-8c2c679dfbfb",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T16:50:00",
            "endsAt": "2019-09-09T17:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "125611",
            "title": "Nitrogen in your (test) pyramid.",
            "description": "Unit, integration, UI tests are part of the famous test pyramid, different tools were used in order to full fill it, but still today there are lot of issues about how to execute it in a proper manner and how to sync all environments (local, ci, etc) in order to satisfy all the testing criteria, and having a good reports. From IO 2018 with the announcement of project Nitrogen, Google'd like to \"nitrogenize\" our tests creating a single entry point and solve all issues we had in the past. With October release of Robolectric 4.0 and androidx.test 1.0.0, both testing environments are converging on a set of common test APIs. Robolectric now supports the AndroidJUnit4 test runner, ActivityTestRule, and Espresso for interacting with UI components. Let's see togheter how to organise different levels of our 'test pyramid', with a focus to the last news/releases in order ot be ready for the Nitrogen release.",
            "startsAt": "2019-09-09T17:00:00",
            "endsAt": "2019-09-09T17:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b8e52efe-7709-4af8-8e97-cb07860b8e24",
                "name": "Enrico Bruno Del Zotto"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "014b2306-297b-4aa1-8474-f52bf299ac20",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-09T17:40:00",
            "endsAt": "2019-09-09T17:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "137380",
            "title": "Tensor Flow for Android Devs",
            "description": "Introduction to the Tensorflow from an Android developers Point of view. We will go through a simple example, explaining the steps, hurdles of integration a TensorFlow model into a mobile application. In the end, you will understand the process of working with TensorFlow on Android devices. Hopefully, this will motivate you to implement your crazy AI ideas in the mobile world.",
            "startsAt": "2019-09-09T17:50:00",
            "endsAt": "2019-09-09T18:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3bd5e927-ef54-4335-9592-480c48c0ac35",
                "name": "Attila Blenesi"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "93b90883-1129-4774-a066-e8ca7107ff71",
            "title": "General Party",
            "description": null,
            "startsAt": "2019-09-09T18:30:00",
            "endsAt": "2019-09-09T20:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 5961,
        "name": "Pie",
        "sessions": [
          {
            "id": "137194",
            "title": "Coroutine-first Android architecture",
            "description": "Coroutines allow us to write asynchronous code in an easy-to-read, declarative style.  The structured concurrency pattern allows us to write this code without fear of leaks.  But there’s much more to the coroutines API than suspend modifiers and CoroutineScopes, and with these new abilities should come new patterns.\r\n\r\nIn this talk, we’ll discuss the power behind structured concurrency and how we can use it to make our entire stack lifecycle-aware.  We’ll see how we can use the tools coroutines give us to inform our application architecture, so that we can quickly write maintainable and testable features at a large scale.",
            "startsAt": "2019-09-09T10:00:00",
            "endsAt": "2019-09-09T10:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8e84df8b-57d6-4ca3-8bb6-bf6a5cb2f04c",
                "name": "Rick Busarow"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "137193",
            "title": "Getting big payouts with Koin",
            "description": "Thanks to its clean design, Koin is quickly gaining popularity as a service locator framework.  Highlights include its excellent documentation, accessible api, and the pure Kotlin source code.\r\n\r\nIn this talk, we’ll go over basic usage like factories, singles, and modules.  We’ll talk about scoping and lazy-loading modules, and we’ll look at its integration with Android screens and ViewModels.  Then, and most importantly, we’ll see how we can use Koin to quickly and easily generate mocked dependencies for clean and hermetic tests.",
            "startsAt": "2019-09-09T11:00:00",
            "endsAt": "2019-09-09T11:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8e84df8b-57d6-4ca3-8bb6-bf6a5cb2f04c",
                "name": "Rick Busarow"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "135768",
            "title": "RIBs - Fragments which actually work",
            "description": "At Uber we are using our own architecture called RIBs which allows us to build testable and scalable single-Activity applications in a team with more than 200 Android engineers.\r\n\r\nThis talk will be split into following parts:\r\n- Unspoken problems of a Clean Architecture. How do you actually connect things together?\r\n- Problems we encountered at Uber scale.\r\n- Why not Fragments?\r\n- What is RIB.\r\n- How we apply RIB to our problems.\r\n- RIB is open sourced",
            "startsAt": "2019-09-09T11:50:00",
            "endsAt": "2019-09-09T12:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "de958717-8a6f-49ba-ba2f-3f1d65a13f66",
                "name": "Dmitry Zaytsev"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "121987",
            "title": "Refactoring Risky Code",
            "description": "How do you refactor bluetooth code on Android with zero test coverage? When touching such code you have to test it with real phones and bluetooth devices to ensure you are not breaking anything. Thus changes come with a high risk of introducing new bugs. At mySugr we spent quite some time refactoring our bluetooth code, so that we can write plain Kotlin unit tests for it and easily add new functionality. \r\n\r\nYou are going to see how we achieved the refactoring with almost zero bugs and a minimal manual testing effort. This talk doesn’t deal with the details of bluetooth on Android. Instead, we will discuss the strategies and methods we used and how it can be applied to any refactoring of dangerous code. Finally, I’m going to show you that you can even write tests for bluetooth code - there is no excuse not to write tests. ",
            "startsAt": "2019-09-09T13:30:00",
            "endsAt": "2019-09-09T14:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3190b56c-b4fc-46bf-8e34-e4b28af676e9",
                "name": "Philipp Hofmann"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "136906",
            "title": "Learning How to Learn Kotlin",
            "description": "There are innumerable things I learned that I never ended up using, and other things I wish I had spent more time on. With the lessons learned over the course of my time teaching and developing with Kotlin, these are my recommendations on how you should learn Kotlin.\r\n\r\nDoesn't matter if you are developing for Android, server-side or native, Kotlin has so many great features which are very specific to the language, it’s very important for us to learn these things in details to take advantage of it.",
            "startsAt": "2019-09-09T14:20:00",
            "endsAt": "2019-09-09T15:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "728504d0-97f2-4f34-8558-0e91b2aa1419",
                "name": "Noe Branagan"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "131513",
            "title": "The Hitchhikers Guide Through Kotlin Multiplatform",
            "description": "Since the early days of mobile that we keep seeing new frameworks being designed to overcome one of the biggest challenges:\r\n* How can I develop for both Android and iOS?\r\n\r\nAlthough it’s initial promises, when we talk about performance, maintainability or even customization we keep discarding these solutions and we always choose native.\r\n\r\n\r\nFast forward to the present, and now we have two new languages: Android is Kotlin first and iOS, Swift. And if you put them side by side you can see a lot of similarities between both what will ease switching between one to the other if you have to develop for both platforms.\r\n\r\nBut what I told that you could just develop in Kotlin and run it seamlessly on all devices?\r\n\r\nHere comes Kotlin Multiplatform!",
            "startsAt": "2019-09-09T15:10:00",
            "endsAt": "2019-09-09T15:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "2bc1e95f-1243-4ad0-8a11-75541fee10e0",
                "name": "Carlos Mota"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "118127",
            "title": "Tackling Android Development at Scale",
            "description": "In just under a year, our Android team exploded from 4 people to 21! As the team and project grew, we found what worked before needed to change to feed our team’s ever-growing needs. We needed to scale both project and processes in a sustainable way. In this talk, I will share reflections from my time at N26, where we’re building the bank the world loves to use. \r\n\r\nWe’ll look at questions like: What were our biggest technical challenges? How did we prevent bottlenecks? How did we maintain consistency and not block creativity? What were our biggest mistakes and how did we solve them? \r\n\r\nBy the end of this talk you will have a better understanding of the problems scaling an Android team, how to tackle them and how to create a safe and productive environment.",
            "startsAt": "2019-09-09T16:10:00",
            "endsAt": "2019-09-09T16:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f1cfd8b3-7db9-4980-8081-5eb1f4448bbd",
                "name": "Fábio Carballo"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "128052",
            "title": "Next generation Android UI with Jetpack Compose",
            "description": "Android Widgets have been in existence since the very first version of Android. Since Android 1.0 and now, mobile UI paradigms and needs have changed dramatically. There have been great solutions that leverage the existing UI widgets and improve them, such as Support Libraries for backwards support and Data Binding for a reactive-like UI updates. Though they served us well, the new Kotlin-first approach by Google allow us to imagine what a modern UI framework would look like. Idiomatic, Kotlin-first, with retro-compatibility from the get go and support for live-previews, Jetpack Compose is Google's new experimental way of tackling Android's UI, built from the ground up without any dependence on pre-existing Android Widgets.",
            "startsAt": "2019-09-09T17:00:00",
            "endsAt": "2019-09-09T17:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "2cd6dc19-2854-411d-9caa-cb35f9eed802",
                "name": "Pedro Veloso"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "130460",
            "title": "MVI with Jetpack Compose",
            "description": "A little intro on how Jetpack Compose will help use a real MVI approach in the Android world. ",
            "startsAt": "2019-09-09T17:50:00",
            "endsAt": "2019-09-09T18:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "20f42a9e-5775-412c-8452-e5c00db447a1",
                "name": "Luca Nicoletti"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "08:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "97c02802-3078-42ee-814a-95fc32be9f1a",
              "title": "Checkin",
              "description": null,
              "startsAt": "2019-09-09T08:00:00",
              "endsAt": "2019-09-09T09:00:00",
              "isServiceSession": true,
              "isPlenumSession": false,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "723d8074-f67e-4f2a-b063-8af45fe9a5c5",
              "title": "Welcome Address",
              "description": "Greg Fawson, COO - DroidconGlobal\nFábio Pinho - Droidcon Lisbon organizer",
              "startsAt": "2019-09-09T09:00:00",
              "endsAt": "2019-09-09T09:10:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:10:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "143176",
              "title": "Back to the basics - You don't need to know it all",
              "description": "Let's be honest, It's freaking hard to keep up to date with all the latest libraries, APIs, architectures and trends that appear in the Android development world every now and then.\r\n\r\nAnd we, as professionals that care about the software we produce, try (and usually fail) at learning about everything. The more time we spend, the more we realize we only know a fraction of the total.\r\n\r\nShould we work harder? Stop sleeping at nights? Or maybe there's another way? What if we are putting our effort in the wrong direction?\r\n\r\nI'll talk about the stages that a developer can go through, and what's my point of view of a healthier relationship with software development.",
              "startsAt": "2019-09-09T09:10:00",
              "endsAt": "2019-09-09T09:50:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "70acc869-c1f3-4474-9750-dee1b2b9b59b",
                  "name": "Antonio Leiva"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "4952e588-d759-485d-a1ff-416ce8376c48",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T09:50:00",
              "endsAt": "2019-09-09T10:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "121988",
              "title": "Faster builds on Android - from 2 minutes to 2 seconds",
              "description": "What does a developer do when a build takes 2 minutes? He gets bored and his mind starts to wander. Maybe he opens Reddit, Twitter orMedium or checks his emails. Switching context and multitasking kills productivity. Every developer needs fast feedback, so he can get jump into the flow state. Therefore, fast builds are essential for productive development. \r\n\r\nFirst, we take a look into Gradle Build Scans. There is no sense in accelerating your build without measuring and comparing the different outcomes. Gradle Build Scans help you to understand what happens during your build and which parts consume the most time. \r\n\r\nThen we continue with basic tips to tweak your build with Gradle. Most of those tips are quick wins, because they only require a simple change in the Gradle build settings. \r\n\r\nFinally, we take a look into how modularisation influences the build speed by an example. Doing it right you can change your business logic and run your tests in 2 seconds instead of 2 minutes.",
              "startsAt": "2019-09-09T10:00:00",
              "endsAt": "2019-09-09T10:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3190b56c-b4fc-46bf-8e34-e4b28af676e9",
                  "name": "Philipp Hofmann"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "137194",
              "title": "Coroutine-first Android architecture",
              "description": "Coroutines allow us to write asynchronous code in an easy-to-read, declarative style.  The structured concurrency pattern allows us to write this code without fear of leaks.  But there’s much more to the coroutines API than suspend modifiers and CoroutineScopes, and with these new abilities should come new patterns.\r\n\r\nIn this talk, we’ll discuss the power behind structured concurrency and how we can use it to make our entire stack lifecycle-aware.  We’ll see how we can use the tools coroutines give us to inform our application architecture, so that we can quickly write maintainable and testable features at a large scale.",
              "startsAt": "2019-09-09T10:00:00",
              "endsAt": "2019-09-09T10:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8e84df8b-57d6-4ca3-8bb6-bf6a5cb2f04c",
                  "name": "Rick Busarow"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "10:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "5bdf4964-8fce-4adc-9469-612607f8feee",
              "title": "Coffee Break",
              "description": null,
              "startsAt": "2019-09-09T10:40:00",
              "endsAt": "2019-09-09T11:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "11:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "133993",
              "title": "Structured Concurrency: Asynchronous shift in Kotlin",
              "description": "Before Kotlin Coroutines (async programming in Kotlin) was stable, they were launched in a way that made them difficult to maintain and track down. \r\n\r\nStructured Concurrency introduced changes to solve these problems but also involved an ideological shift in order to use them. \r\n\r\nIn this talk, you'll learn how to do async programming in Kotlin using Structured Concurrency principles covering topics such as launching coroutines, scopes, error handling and testing.",
              "startsAt": "2019-09-09T11:00:00",
              "endsAt": "2019-09-09T11:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b4cf78c9-623b-4b8f-b676-097fb7802668",
                  "name": "Manuel Vivo"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "137193",
              "title": "Getting big payouts with Koin",
              "description": "Thanks to its clean design, Koin is quickly gaining popularity as a service locator framework.  Highlights include its excellent documentation, accessible api, and the pure Kotlin source code.\r\n\r\nIn this talk, we’ll go over basic usage like factories, singles, and modules.  We’ll talk about scoping and lazy-loading modules, and we’ll look at its integration with Android screens and ViewModels.  Then, and most importantly, we’ll see how we can use Koin to quickly and easily generate mocked dependencies for clean and hermetic tests.",
              "startsAt": "2019-09-09T11:00:00",
              "endsAt": "2019-09-09T11:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8e84df8b-57d6-4ca3-8bb6-bf6a5cb2f04c",
                  "name": "Rick Busarow"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "11:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "42f123ed-dc99-4175-b88b-521cf799201f",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T11:40:00",
              "endsAt": "2019-09-09T11:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "11:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "133175",
              "title": "Getting the most out of code review",
              "description": "Is your team not reviewing code? You should be! Does it feel like you could be getting more out of code reviews? Absolutely! Code reviews are severely underutilized.  Let me show you some approaches to get more value from code reviews for you and your team.  \r\n\r\nI will emphasize code review best practices starting with why you should be performing code reviews.  Some teams don't perform reviews and this is really hurting them in the long run. I will attempt to sell the review process and explain why it is fundamental to our roles as developers.  \r\n\r\nTeams that are performing reviews may feel burdened by doing so and see it as chore. This also is not ideal and I will dig a little deeper and discuss why we feel this way sometimes. What are the strategies to overcome this feeling? Is it possible to enjoy code review?\r\n\r\nAre there shortcuts to work more efficiently at reviewing code? Absolutely! Can some things be automated? What can't? Let me show you some great approaches to making the review process streamlined and efficient. ",
              "startsAt": "2019-09-09T11:50:00",
              "endsAt": "2019-09-09T12:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c1bf1c38-8e9f-48a8-83fe-8a30f676e1d5",
                  "name": "Brian Plummer"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "135768",
              "title": "RIBs - Fragments which actually work",
              "description": "At Uber we are using our own architecture called RIBs which allows us to build testable and scalable single-Activity applications in a team with more than 200 Android engineers.\r\n\r\nThis talk will be split into following parts:\r\n- Unspoken problems of a Clean Architecture. How do you actually connect things together?\r\n- Problems we encountered at Uber scale.\r\n- Why not Fragments?\r\n- What is RIB.\r\n- How we apply RIB to our problems.\r\n- RIB is open sourced",
              "startsAt": "2019-09-09T11:50:00",
              "endsAt": "2019-09-09T12:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "de958717-8a6f-49ba-ba2f-3f1d65a13f66",
                  "name": "Dmitry Zaytsev"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "12:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "36b1fe6d-ed3a-40f9-a712-3c5e5e622dcb",
              "title": "Lunch Break",
              "description": null,
              "startsAt": "2019-09-09T12:30:00",
              "endsAt": "2019-09-09T13:30:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "13:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "123016",
              "title": "Life is too short not to use ADB commands",
              "description": "ADB is a versatile command-line tool that lets you communicate with a device. The ADB command facilitates a variety of device actions, such as installing and debugging apps, and it provides access to a Unix shell that you can use to run a variety of commands on a device. It is maybe one of the most used tools by the Android developers, but it is for sure the less known.\r\n\r\nDo you want to learn the basic ADB commands or extends your knowledge with some advanced commands? Are you struggling with some bugs? Are you tired to perform some repetitive test? This talk is for you! You can make ADB works for you with automation and assist you to kill bugs. I spent weeks diving into the ADB commands for Sony Mobile and Motorola, and I learned helpful commands that will make your life easier.\r\n\r\nIt's time for me to share this with you! Here is an outline:\r\n- How does it work? \r\n- Brushing up some basics commands\r\n- Some ADB commands you may have never heard about\r\n- Identify bugs\r\n- Automation",
              "startsAt": "2019-09-09T13:30:00",
              "endsAt": "2019-09-09T14:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1ee57fa9-790a-4a61-a980-6ef301818aea",
                  "name": "Zhenlei Ji"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "121987",
              "title": "Refactoring Risky Code",
              "description": "How do you refactor bluetooth code on Android with zero test coverage? When touching such code you have to test it with real phones and bluetooth devices to ensure you are not breaking anything. Thus changes come with a high risk of introducing new bugs. At mySugr we spent quite some time refactoring our bluetooth code, so that we can write plain Kotlin unit tests for it and easily add new functionality. \r\n\r\nYou are going to see how we achieved the refactoring with almost zero bugs and a minimal manual testing effort. This talk doesn’t deal with the details of bluetooth on Android. Instead, we will discuss the strategies and methods we used and how it can be applied to any refactoring of dangerous code. Finally, I’m going to show you that you can even write tests for bluetooth code - there is no excuse not to write tests. ",
              "startsAt": "2019-09-09T13:30:00",
              "endsAt": "2019-09-09T14:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3190b56c-b4fc-46bf-8e34-e4b28af676e9",
                  "name": "Philipp Hofmann"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "14:10:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "73504d0a-a0fd-4447-a24d-cfdefe8ed005",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T14:10:00",
              "endsAt": "2019-09-09T14:20:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "14:20:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "122647",
              "title": "Building Voice-First Android Apps",
              "description": "Thanks to the latest advancements in Machine Learning, we're now capable of interacting with machines through natural language. The age of voice assistants is here with Alexa, the Google Assistant and others. But, as an Android developer, what can I do on my existing app in relation to conversational features?\r\n\r\nWhen we think about developing features that are voice-forward, we think about existing voice assistants such as Alexa and the Google Assistant. What about the fully-capable computers that we have with us all the time, our smartphones? Some moments on our day to day lives are very well suited for voice interactions: while in a car or cooking for example. Let's not forget that voice interactions are extremely accessible, not only in a physical way (for people with dexterity or motion impediments) but also in a cognitive way (I think we all have a loved one in our lives that really struggles with technology, and people from some emerging countries have very limited access to computers and are not at ease with technology).\r\n\r\nIn this talk, I'll explain what integrations can be done on Android:\r\n- 1st-party solutions such as the SpeechRecognizer and TextToSpeech APIs\r\n- Other Google solutions such as ML Kit, TensorFlow and Dialogflow\r\n- 3rd-party solutions such as Porcupine, Snips, Amazon Lex, Snowboy and PocketSphinx\r\n- Integration with the Google Assistant via App Actions",
              "startsAt": "2019-09-09T14:20:00",
              "endsAt": "2019-09-09T15:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
                  "name": "Elaine Dias Batista"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "136906",
              "title": "Learning How to Learn Kotlin",
              "description": "There are innumerable things I learned that I never ended up using, and other things I wish I had spent more time on. With the lessons learned over the course of my time teaching and developing with Kotlin, these are my recommendations on how you should learn Kotlin.\r\n\r\nDoesn't matter if you are developing for Android, server-side or native, Kotlin has so many great features which are very specific to the language, it’s very important for us to learn these things in details to take advantage of it.",
              "startsAt": "2019-09-09T14:20:00",
              "endsAt": "2019-09-09T15:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "728504d0-97f2-4f34-8558-0e91b2aa1419",
                  "name": "Noe Branagan"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "15:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "a1dfb382-b356-4ed1-a153-d0da2916b34a",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T15:00:00",
              "endsAt": "2019-09-09T15:10:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "15:10:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "127892",
              "title": "Experimentation at scale: fuel your application’s growth through A/B testing",
              "description": "As an Android Engineer in the Lyft Growth’s team, my role is to develop features and pieces of infrastructure the will grow the audience of the app.\r\n\r\nIn this talk I want to cover:\r\n- A/B testing 101\r\n- How to implement an A/B testing framework (or integrate with existing an solution if you don’t want to build it from scratch)\r\n- Identify growth opportunities in your app (1. funnel definition, 2. funnel optimization)\r\n- Pitfalls of A/B testing:\r\n   - Statistical significance,\r\n   - Novelty effect,\r\n   - Overexposure / Underexposure,\r\n   - Proper targeting for the correct sample size \r\n\r\n\r\nThis talk targets: Android/iOS engineer interested in Growth but also potentially Product Managers and CEOs",
              "startsAt": "2019-09-09T15:10:00",
              "endsAt": "2019-09-09T15:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
                  "name": "Thomas Ezan"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "131513",
              "title": "The Hitchhikers Guide Through Kotlin Multiplatform",
              "description": "Since the early days of mobile that we keep seeing new frameworks being designed to overcome one of the biggest challenges:\r\n* How can I develop for both Android and iOS?\r\n\r\nAlthough it’s initial promises, when we talk about performance, maintainability or even customization we keep discarding these solutions and we always choose native.\r\n\r\n\r\nFast forward to the present, and now we have two new languages: Android is Kotlin first and iOS, Swift. And if you put them side by side you can see a lot of similarities between both what will ease switching between one to the other if you have to develop for both platforms.\r\n\r\nBut what I told that you could just develop in Kotlin and run it seamlessly on all devices?\r\n\r\nHere comes Kotlin Multiplatform!",
              "startsAt": "2019-09-09T15:10:00",
              "endsAt": "2019-09-09T15:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "2bc1e95f-1243-4ad0-8a11-75541fee10e0",
                  "name": "Carlos Mota"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "15:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "9ff30066-3872-4361-ac81-ae0af4c60284",
              "title": "Coffee Break",
              "description": null,
              "startsAt": "2019-09-09T15:50:00",
              "endsAt": "2019-09-09T16:10:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "16:10:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "137303",
              "title": "Bye bye RxJava: Building flexible SDKs with Kotlin and Coroutines",
              "description": "We've made some mistakes building our client-facing SDKs over the last two years at Babylon Health.\r\n\r\nRxJava has been around in Android development for years, and we've learned a great deal about it. It's a powerful tool, but with great power comes great responsibility. And really - you should always use the right tool for the job, not the most \"powerful\" one. Now we have a new tool in our toolbox - Coroutines - and they seem better suited to a typical Android business layer. It doesn't mean RxJava should be entirely out of the window, as for us it's still quite useful on the UI layer.\r\n\r\nWe're here to share why and how we went from a heavily RxJava based SDK architecture to a more client and developer-friendly approach replacing most of our code with Kotlin & Coroutines and compare both solutions.\r\n\r\nWe will admit to mistakes, share the principles that guided us in our planning for fixing them and show you how we came up with a plan and executed it.",
              "startsAt": "2019-09-09T16:10:00",
              "endsAt": "2019-09-09T16:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4ecc4ff8-c63c-4b9e-927a-7c4094f5b8ea",
                  "name": "Mikołaj Leszczyński"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "118127",
              "title": "Tackling Android Development at Scale",
              "description": "In just under a year, our Android team exploded from 4 people to 21! As the team and project grew, we found what worked before needed to change to feed our team’s ever-growing needs. We needed to scale both project and processes in a sustainable way. In this talk, I will share reflections from my time at N26, where we’re building the bank the world loves to use. \r\n\r\nWe’ll look at questions like: What were our biggest technical challenges? How did we prevent bottlenecks? How did we maintain consistency and not block creativity? What were our biggest mistakes and how did we solve them? \r\n\r\nBy the end of this talk you will have a better understanding of the problems scaling an Android team, how to tackle them and how to create a safe and productive environment.",
              "startsAt": "2019-09-09T16:10:00",
              "endsAt": "2019-09-09T16:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f1cfd8b3-7db9-4980-8081-5eb1f4448bbd",
                  "name": "Fábio Carballo"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "16:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "48cb48a2-62f7-4de2-9b2a-8c2c679dfbfb",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T16:50:00",
              "endsAt": "2019-09-09T17:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "17:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "125611",
              "title": "Nitrogen in your (test) pyramid.",
              "description": "Unit, integration, UI tests are part of the famous test pyramid, different tools were used in order to full fill it, but still today there are lot of issues about how to execute it in a proper manner and how to sync all environments (local, ci, etc) in order to satisfy all the testing criteria, and having a good reports. From IO 2018 with the announcement of project Nitrogen, Google'd like to \"nitrogenize\" our tests creating a single entry point and solve all issues we had in the past. With October release of Robolectric 4.0 and androidx.test 1.0.0, both testing environments are converging on a set of common test APIs. Robolectric now supports the AndroidJUnit4 test runner, ActivityTestRule, and Espresso for interacting with UI components. Let's see togheter how to organise different levels of our 'test pyramid', with a focus to the last news/releases in order ot be ready for the Nitrogen release.",
              "startsAt": "2019-09-09T17:00:00",
              "endsAt": "2019-09-09T17:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b8e52efe-7709-4af8-8e97-cb07860b8e24",
                  "name": "Enrico Bruno Del Zotto"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "128052",
              "title": "Next generation Android UI with Jetpack Compose",
              "description": "Android Widgets have been in existence since the very first version of Android. Since Android 1.0 and now, mobile UI paradigms and needs have changed dramatically. There have been great solutions that leverage the existing UI widgets and improve them, such as Support Libraries for backwards support and Data Binding for a reactive-like UI updates. Though they served us well, the new Kotlin-first approach by Google allow us to imagine what a modern UI framework would look like. Idiomatic, Kotlin-first, with retro-compatibility from the get go and support for live-previews, Jetpack Compose is Google's new experimental way of tackling Android's UI, built from the ground up without any dependence on pre-existing Android Widgets.",
              "startsAt": "2019-09-09T17:00:00",
              "endsAt": "2019-09-09T17:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "2cd6dc19-2854-411d-9caa-cb35f9eed802",
                  "name": "Pedro Veloso"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "014b2306-297b-4aa1-8474-f52bf299ac20",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-09T17:40:00",
              "endsAt": "2019-09-09T17:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "17:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "137380",
              "title": "Tensor Flow for Android Devs",
              "description": "Introduction to the Tensorflow from an Android developers Point of view. We will go through a simple example, explaining the steps, hurdles of integration a TensorFlow model into a mobile application. In the end, you will understand the process of working with TensorFlow on Android devices. Hopefully, this will motivate you to implement your crazy AI ideas in the mobile world.",
              "startsAt": "2019-09-09T17:50:00",
              "endsAt": "2019-09-09T18:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3bd5e927-ef54-4335-9592-480c48c0ac35",
                  "name": "Attila Blenesi"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "130460",
              "title": "MVI with Jetpack Compose",
              "description": "A little intro on how Jetpack Compose will help use a real MVI approach in the Android world. ",
              "startsAt": "2019-09-09T17:50:00",
              "endsAt": "2019-09-09T18:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "20f42a9e-5775-412c-8452-e5c00db447a1",
                  "name": "Luca Nicoletti"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "18:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "93b90883-1129-4774-a066-e8ca7107ff71",
              "title": "General Party",
              "description": null,
              "startsAt": "2019-09-09T18:30:00",
              "endsAt": "2019-09-09T20:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      }
    ]
  },
  {
    "date": "2019-09-10T00:00:00",
    "rooms": [
      {
        "id": 5960,
        "name": "Oreo",
        "sessions": [
          {
            "id": "6801bc62-9449-44a3-974e-ca6785589dcc",
            "title": "Registration and Check-In",
            "description": null,
            "startsAt": "2019-09-10T08:00:00",
            "endsAt": "2019-09-10T09:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "133992",
            "title": "What's Q in Android UI",
            "description": "New UI Features are the most visible changes for you app users. As the OS and the other apps move forward, your app can easily left out with a broken experience.\r\n\r\nCome to this talk to learn more about new UI features that can make your application stand out. In this talk, you’ll learn how to implement the new Android Q UI features that will bring your app’s User Experience to a new level:\r\n\r\n- Foldables\r\n- Bubbles\r\n- New ShareSheet and Direct Share\r\n- Gestural Navigation and Edge to Edge display\r\n- Settings Panels",
            "startsAt": "2019-09-10T09:00:00",
            "endsAt": "2019-09-10T09:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b4cf78c9-623b-4b8f-b676-097fb7802668",
                "name": "Manuel Vivo"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "42dac301-5550-4432-ad87-8d082345dd50",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T09:40:00",
            "endsAt": "2019-09-10T09:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "140368",
            "title": "Where the Heck Am I? Understanding Location in Your Application",
            "description": "Using GPS to find out exactly where we are is one of the more awesome powers of our mobile devices. It also poses some of the toughest challenges to developers, who must prevent excessive battery drain and deal with insufficient accuracy. In this talk we will learn how to face these challenges by answering questions such as: How does GPS even work? Where the heck did my battery go? Why does it take so long to get a good fix? And why does my phone think I’m in the middle of a lake? If you’ve ever wanted to understand how satellite navigation actually works, this is the talk for you. (It also features cold war intrigue, applied relativity theory, and a picture of a dinosaur. So you know it’s going to be good.)",
            "startsAt": "2019-09-10T09:50:00",
            "endsAt": "2019-09-10T10:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b3d47b09-a9c9-4769-a25c-188e3d091e34",
                "name": "Richard Süselbeck"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "83e240e0-adcb-4766-a91b-5993a1b04f80",
            "title": "Coffee Break",
            "description": null,
            "startsAt": "2019-09-10T10:30:00",
            "endsAt": "2019-09-10T10:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "130657",
            "title": "Roasting Google APIs on a Firebase to Create Uberritos",
            "description": "This talk will help developers learn how to create an Uber like app within hours and zero lines of backend code, leveraging the capabilities of Firebase – a realtime database in the cloud as a data provider and Google Maps, Places and Directions APIs as a case study for the sample app.",
            "startsAt": "2019-09-10T10:50:00",
            "endsAt": "2019-09-10T11:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "03c63012-49c4-44eb-af96-0f5360b0d187",
                "name": "Ishan Khanna"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "70282a04-8dcb-4c99-82b5-4897e1a09d99",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T11:30:00",
            "endsAt": "2019-09-10T11:40:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "135785",
            "title": "MyTextUtils or how to lose your business in 1 line",
            "description": "Narrative:\r\n\r\nHey, I wrote a library which converts strings to upper case:\r\n\r\n    MyTextUtils.toUpperCase(\"Hello World!\");\r\n\r\nIt does what it says... and even more. Like stealing user's preferences, data from SQLite tables and sniffing all encrypted data.\r\n\r\nWe will start with an overview of what a 3rd party libraries can have access to, talk a little about annotation processing and finally see how we can try to protect ourselves from such risks.",
            "startsAt": "2019-09-10T11:40:00",
            "endsAt": "2019-09-10T12:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "de958717-8a6f-49ba-ba2f-3f1d65a13f66",
                "name": "Dmitry Zaytsev"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "a6db5b92-65bb-4eef-97af-f14afc28ab09",
            "title": "Lunch",
            "description": null,
            "startsAt": "2019-09-10T12:20:00",
            "endsAt": "2019-09-10T13:20:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "122404",
            "title": "RxJava & Coroutines: A Practical Analysis",
            "description": "Kotlin has taken the Android world by storm, and is quickly becoming the most popular language of choice. With Coroutines now stable, does it make sense to replace your RxJava implementations for Coroutines?\r\n\r\nDespite the hype, it may not make sense to jump on the bandwagon just yet. RxJava has already proven its stability and usefulness, and a comparison between the two frameworks shows that they are simply better suited for different purposes.\r\n\r\nIn this talk you’ll learn:\r\n- how to utilise the strengths of each framework\r\n- how to correctly choose the best solution for the requirements of your project\r\n- whether it may be beneficial to migrate or run them concurrently\r\n- and how you can start doing so for your project",
            "startsAt": "2019-09-10T13:20:00",
            "endsAt": "2019-09-10T14:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
                "name": "Ash Davies"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "8ea58a18-ade3-49aa-b97f-c9a932486cd8",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T14:00:00",
            "endsAt": "2019-09-10T14:10:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "132911",
            "title": "Shrinking WhatsApp",
            "description": "Billions of people in over 180 countries use WhatsApp to stay in touch with friends and family. At WhatsApp we relentlessly work on shrinking our apk as much as possible given that many of our users live in regions with poor connectivity and we are committed to leave no one behind. In this session we will cover some of the wins, regressions, strategies and technologies that we use to tame WhatApp's apk size.",
            "startsAt": "2019-09-10T14:10:00",
            "endsAt": "2019-09-10T14:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "ad3f4881-1d23-4968-8838-b048c5d27e57",
                "name": "Evelio Tarazona Cáceres"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "b007c029-dc81-472f-9fbd-2acd65c56967",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T14:50:00",
            "endsAt": "2019-09-10T15:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "123882",
            "title": "Navigation in Modular Applications with Deep Linking",
            "description": "Android engineering has come a long way. Nowadays most applications are modularized to a certain degree - to combat high compile times, enforce separation of concerns or to group code based on certain scopes.\r\n\r\nIn this talk we will take a look at navigation in modularized apps. Navigation in Android can be done explicitly by passing the class variable or implicit by sending an Intent with a certain configuration. Since modularization is supposed to simplify our dependency graph, we will take a closer look at deep linking as a navigation pattern and compare different approaches like Intent filter, a custom deeplink processor or the Android Jetpack Navigation component. \r\n\r\nAfter this talk, you will be able to modularize your application with a clean, structured and scalable navigation. ",
            "startsAt": "2019-09-10T15:00:00",
            "endsAt": "2019-09-10T15:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "0ee9d8ba-aed3-46f1-bf46-320dfb5cec43",
                "name": "Damian Burke"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "d401e249-7432-4fa2-b388-190ea24b1394",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T15:40:00",
            "endsAt": "2019-09-10T15:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "143230",
            "title": "The Flutter Journey From a Personal App to a Successful Production App",
            "description": "In this talk, I'll explain the process of turning an idea into an app, building it, publishing and lessons learned along the way.\r\n\r\nThe app is 100% in Flutter and powered by Firebase. Thanks to the open source nature of the platform and external dependencies as well as features of the Dart programming language, the development of the app could be done very quickly. The app is currently in production and has 100+ daily active users.\r\n\r\nOther topics that will be covered include:\r\n- Material Design implementation on the Flutter framework\r\n- Resources (strings, styles) management\r\n- Properly managing crash reporting and handling the Flutter red screen of death\r\n- Localization\r\n- Creating flavors\r\n- Tips and common tasks done during development\r\n\r\nFinally, I'll talk about the power of the community and how your users can help you build a better product.",
            "startsAt": "2019-09-10T15:50:00",
            "endsAt": "2019-09-10T16:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
                "name": "Elaine Dias Batista"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "2c1daf56-a94f-4f99-8b5e-5eda2c3b406c",
            "title": "Coffee Break",
            "description": null,
            "startsAt": "2019-09-10T16:30:00",
            "endsAt": "2019-09-10T16:50:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "137048",
            "title": "I have no idea what my app is doing ¯\\_(ツ)_/¯",
            "description": "Do you exactly know what's your app doing when you deliver it to your users? Are you 100% sure? Would you bet on this? You're probably confident with the code you wrote and you know what is doing.\r\n\r\nBut what about the code that others wrote?\r\n\r\nWe pull dependencies from the online repositories every day. Our applications strongly rely on external libraries that are hosted on public Maven repositories. What if one of those library contains some malicious code? Imagine a library that starts harvesting your user data without you knowing it.\r\n\r\nIn this talk we will see how to monitor and protect your application from malicious dependency on the web that might end up in your final compiled App.",
            "startsAt": "2019-09-10T16:50:00",
            "endsAt": "2019-09-10T17:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8730d40b-3fb7-450d-ab71-08c9dd81a48a",
                "name": "Nicola Corti"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "ee5e4924-5c4d-484d-a9ef-b691f7c14b9b",
            "title": "Break",
            "description": null,
            "startsAt": "2019-09-10T17:30:00",
            "endsAt": "2019-09-10T17:40:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "122403",
            "title": "Implementing the Paging Library",
            "description": "The Android Paging Library makes it easy to integrate complex paging behaviour, gradually loading small chunks of data at a time to help reduce usage of network bandwidth and system resources.\r\n\r\nThe library allows you to implement this behaviour using compositional components in a decoupled architecture making your code more reliable, scalable, and testable. Furthermore, you’ll be able to use familiar components such as LiveData or RxJava to interface with your existing architecture.\r\n\r\nIn this talk you’ll learn:\r\n- how to integrate the PagedList component into your architecture\r\n- how to implement a DataSource to load snapshots when necessary\r\n- how to use BoundaryCallback to signal the end of available data\r\n- how to integrate LiveData or RxJava to fit your project",
            "startsAt": "2019-09-10T17:40:00",
            "endsAt": "2019-09-10T18:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
                "name": "Ash Davies"
              }
            ],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          },
          {
            "id": "840d58a2-7cbb-4136-9cef-4634ca49e496",
            "title": "See you next year",
            "description": null,
            "startsAt": "2019-09-10T18:20:00",
            "endsAt": "2019-09-10T18:40:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 5960,
            "room": "Oreo"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 5961,
        "name": "Pie",
        "sessions": [
          {
            "id": "137280",
            "title": "Introduction to Android app security",
            "description": "In this talk we will cover the basics of Android App Security.\r\nWe will first start with an introduction and motivation, talking about why do you need to care about app security, what are the important things to protect, and try to understand the motivation an attacker might have to hack your application.\r\nAfter that we will move on to more technical details, and we will cover the things you (as a developer) can do to protect your applications against the most common security threads. This includes secure networking, user data protection, root detection (and understanding the effects of a rooted device), IP protection, etc.",
            "startsAt": "2019-09-10T09:00:00",
            "endsAt": "2019-09-10T09:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "377a3c7a-eba5-48e0-9057-0a5ff91061cc",
                "name": "Marc Obrador Sureda"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "137114",
            "title": "Play Core library: Take control of Android App Bundles’ dynamic delivery",
            "description": "When you use Android App Bundles (AAB), you get an initial size saving through splitting your application by: screen density, language and ABI.\r\nBut that's just the beginning!\r\nWith AAB as your distribution format, you can use the Play Core library to make your app smaller, on-demand and always up-to-date\r\n\r\nIn this talk you will learn about AAB, dynamic delivery and the features that the Play Core library enables in your applications. It will cover:\r\n* Why and how to start using AAB and dynamic delivery\r\nWhat is the Play Core library and how it interacts with dynamic delivery\r\n* On-demand delivery of additional modules and language resources\r\n* In app updates, covering blocking and non-blocking flows with some bonus  UX considerations\r\n\r\nWe’ll finish by looking at how you can use the new Internal App Sharing to distribute your test builds.\r\n",
            "startsAt": "2019-09-10T09:50:00",
            "endsAt": "2019-09-10T10:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e5941ea5-5a10-45a0-903b-f642db802a16",
                "name": "Pietro Maggi"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "136502",
            "title": "App size reduction at Microsoft SwiftKey",
            "description": "We present our unofficial guide to Android app size and how to squeeze in as much useful functionality into your app in the smallest number of bytes. The SwiftKey team has managed to halve our download and install size by investigating the root causes of bloat as well as taking advantages of the latest developments in Android. We’ve done this whilst continuing to support over 350 languages, 200 themes, 200 keyboard layouts, handwriting recognition, translator, emoji prediction and loads more. ",
            "startsAt": "2019-09-10T10:50:00",
            "endsAt": "2019-09-10T11:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "bb7103dd-61b7-4586-a1f7-ad365f335e54",
                "name": "Praveen Pendyala"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "136759",
            "title": "Make some move with MotionLayout",
            "description": "Always wanted to build better animations ? Let’s explore Motion Layout in order to know its capabilities. MotionLayout beta-1 was release during the Google I/O. It promises to simplify the way we create animation on Android. Based on XML we will be able to describe on animation that could connected to a swipe on the screen or a native component.\r\n\r\nIn this talk, I will explore an Android app that list version of Android. For each version we will discover a new example, starting with basic modification of a constraint. Then adding KeyFrame with position, scale and rotation. Next playing with customs attributes to change the image color saturation. Lastly we will explore connection with Coordinator Layout, View Pager, Drawer and SeekBar.\r\n\r\nAt the end, you should know how to use and what are the capabilities of MotionLayout. Should you use it in your application ?\r\n\r\nWant to know more, you can read this article : https://medium.com/xebia-france/move-my-app-with-motionlayout-part-1-7800637feb22",
            "startsAt": "2019-09-10T11:40:00",
            "endsAt": "2019-09-10T12:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "cd3000b1-acb2-42bb-a656-037844d79383",
                "name": "Alexandre Genet"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "123604",
            "title": "Android Testing Strategy",
            "description": "Testing an Android application was always hard. In the past couple of years we got access to better tools, but we still rely a lot on architecture and design decisions in order to properly test an Android application. This talk will discuss the layers of automated testing an Android application should have, from End-to-end, Component, Integration to Unit tests. Also we will discuss BDD, TDD and Clean Architecture as tools to implement those layers.",
            "startsAt": "2019-09-10T13:20:00",
            "endsAt": "2019-09-10T14:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4497e030-9577-4439-a9d0-6cc6d165ff59",
                "name": "Marcelo Benites"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "131746",
            "title": "Best of sign in experience",
            "description": "Have you ever thought about how often you have implemented login features in an app? As a user have you ever thought about how often you log in to those apps? The answer might be “pretty often”. Sometimes it relates to security like in banking app, sometimes it’s to be able to provide you with personalized content such as learning materials.  \r\n\r\nAs software engineers, we want to provide an easy and simple for users to log into apps. For first time users of an app, entering login details is the most annoying thing according to various articles.  The result of this is losing potential customers of an app. Thankfully, there are many different and easy ways to register and login nowadays. Google Sign-in, SmartLock or Autofill framework are only a few examples to achieve a better user experience. A few clicks – and voalá – you have a new user.   \r\n\r\nIn this talk, I want to share with you different ways to register and login to apps that result in less effort by the user. The topic will be interesting for engineers to discover how the quality of their products can be improved and learn how to achieve it on Android.  ",
            "startsAt": "2019-09-10T14:10:00",
            "endsAt": "2019-09-10T14:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "807318b3-6a4e-4568-b42c-24d184d54b06",
                "name": "Dmytro Khmelenko"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "134044",
            "title": "How to build a messenger for Android?",
            "description": "It looks so simple outside, the app which can send messages from one user and receive from others. This is what we were thinking from start. 9 months passed we're still on it. In this talk, I will go through the main parts of the messenger project such as transport, synchronization, architecture, storage, pagination as well as explain common mistakes we've made on the way to instant messenger. \r\n\r\nYou’ll leave this talk with a solid understanding of how modern messengers are built and the confidence to get started.\r\n",
            "startsAt": "2019-09-10T15:00:00",
            "endsAt": "2019-09-10T15:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "0500b7f7-51c4-4997-ba87-8b50a6a44ab4",
                "name": "Andrii Rakhimov"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "135726",
            "title": "Secure Derivation of Passwords in Android",
            "description": "As Android developers, security matters in Android development. With the rapid growth of Android devices in the world, Security has never been as important as it is today, and it will never be an outdated subject.\r\nPasswords or passphrases created by humans are often short or predictable enough to allow password cracking. Taking some examples of several common attacks we will explain why using the password directly for encryption and authentification is risky. We will understand how Secure Derivation of Passwords can prevent password cracking. And most important, we will talk about what are the solutions on Android.\r\n\r\nIn this talk you will learn password security on Android:\r\n- Cryptographic knowledge about password cracking\r\n- What is the key derivation\r\n- Solutions for key derivation\r\n- How to improve password security on Android using Password-based key derivation functions?\r\n- What are the existing Android framework API solutions, the limitations, the improvements?\r\n- On Android, how to use modern password-based key derivation functions such as PBKDF2 and Argon2\r\n\r\nAndroid engineers interested in improving password security and understanding cryptographic in Android development are definitely recommended to come to this talk.",
            "startsAt": "2019-09-10T15:50:00",
            "endsAt": "2019-09-10T16:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "0cc865f0-2d9d-479d-b247-181ff5b8357a",
                "name": "Xiaoyi Li"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "136448",
            "title": "Cut your APK size with features on demand",
            "description": "Do APK or app size matters?\r\nDoes a user think about the APK size before downloading it?\r\nDoes a user think about space, an app occupying on the phone?\r\nIs your App size is more than just a few MBs?\r\n\r\nWhat if we provide very basic functionality and let the user decide whether he wants the advanced or additional functionality or not?\r\n\r\nYes, The user thinks about the app size before downloading or updating an app which has a size larger than a few MBs. The user thinks about the data also over which he will be downloading or updating that app. He or she even think about how much space will it take on his or her device. In this fight of space in the device and size of the app, the apps having a smaller size and frequent utility wins the battle. \r\n\r\nWhat if we provide very basic functionality and let the user decide whether he wants the advanced or additional functionality or not. What if he or she can download only the features he needs on demand and keep the app compact. \r\n\r\nGoogle new feature of dynamic delivery enables us to deliver the features on demand. This helps us to reduce the size of APK and even enables the user to choose what features he needs. From a developers perspective, this is very easy to implement and maintain.\r\n\r\nEven we (Sharechat) were also at the same state where the size of APK was an issue with the new set of features we were trying to implement. Google Dynamic delivery came to the rescue.\r\n\r\nWhat is actually a dynamic delivery?\r\nHow can we reduce the APK size with it?\r\nHow it can help a user?\r\nHow to implement it in Android?\r\nHow difficult is it to implement in the existing code base?\r\nHow will it look to the user in the app?\r\n\r\nWell, let's get all these questions answered in the talk along with our experiences and challenges we faced.",
            "startsAt": "2019-09-10T16:50:00",
            "endsAt": "2019-09-10T17:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e3617ae8-580d-483d-9830-01a1ced6ecf2",
                "name": "Suneet Agrawal"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          },
          {
            "id": "146273",
            "title": "NDK First Steps",
            "description": "Starting at NDK may not be easy sometimes so in this session it will be explained the basics of NDK, advantages and disadvantages. Additionally, it will be given an introduction on how to create a project with NDK and explained the main artefacts that are needed to connect NDK with the SDK.",
            "startsAt": "2019-09-10T17:40:00",
            "endsAt": "2019-09-10T18:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "9130eaf2-39ca-47f3-ac5d-c7be6cd9805d",
                "name": "Jorge Mendes"
              }
            ],
            "categories": [],
            "roomId": 5961,
            "room": "Pie"
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "08:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "6801bc62-9449-44a3-974e-ca6785589dcc",
              "title": "Registration and Check-In",
              "description": null,
              "startsAt": "2019-09-10T08:00:00",
              "endsAt": "2019-09-10T09:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "133992",
              "title": "What's Q in Android UI",
              "description": "New UI Features are the most visible changes for you app users. As the OS and the other apps move forward, your app can easily left out with a broken experience.\r\n\r\nCome to this talk to learn more about new UI features that can make your application stand out. In this talk, you’ll learn how to implement the new Android Q UI features that will bring your app’s User Experience to a new level:\r\n\r\n- Foldables\r\n- Bubbles\r\n- New ShareSheet and Direct Share\r\n- Gestural Navigation and Edge to Edge display\r\n- Settings Panels",
              "startsAt": "2019-09-10T09:00:00",
              "endsAt": "2019-09-10T09:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b4cf78c9-623b-4b8f-b676-097fb7802668",
                  "name": "Manuel Vivo"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "137280",
              "title": "Introduction to Android app security",
              "description": "In this talk we will cover the basics of Android App Security.\r\nWe will first start with an introduction and motivation, talking about why do you need to care about app security, what are the important things to protect, and try to understand the motivation an attacker might have to hack your application.\r\nAfter that we will move on to more technical details, and we will cover the things you (as a developer) can do to protect your applications against the most common security threads. This includes secure networking, user data protection, root detection (and understanding the effects of a rooted device), IP protection, etc.",
              "startsAt": "2019-09-10T09:00:00",
              "endsAt": "2019-09-10T09:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "377a3c7a-eba5-48e0-9057-0a5ff91061cc",
                  "name": "Marc Obrador Sureda"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "09:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "42dac301-5550-4432-ad87-8d082345dd50",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T09:40:00",
              "endsAt": "2019-09-10T09:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "140368",
              "title": "Where the Heck Am I? Understanding Location in Your Application",
              "description": "Using GPS to find out exactly where we are is one of the more awesome powers of our mobile devices. It also poses some of the toughest challenges to developers, who must prevent excessive battery drain and deal with insufficient accuracy. In this talk we will learn how to face these challenges by answering questions such as: How does GPS even work? Where the heck did my battery go? Why does it take so long to get a good fix? And why does my phone think I’m in the middle of a lake? If you’ve ever wanted to understand how satellite navigation actually works, this is the talk for you. (It also features cold war intrigue, applied relativity theory, and a picture of a dinosaur. So you know it’s going to be good.)",
              "startsAt": "2019-09-10T09:50:00",
              "endsAt": "2019-09-10T10:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b3d47b09-a9c9-4769-a25c-188e3d091e34",
                  "name": "Richard Süselbeck"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "137114",
              "title": "Play Core library: Take control of Android App Bundles’ dynamic delivery",
              "description": "When you use Android App Bundles (AAB), you get an initial size saving through splitting your application by: screen density, language and ABI.\r\nBut that's just the beginning!\r\nWith AAB as your distribution format, you can use the Play Core library to make your app smaller, on-demand and always up-to-date\r\n\r\nIn this talk you will learn about AAB, dynamic delivery and the features that the Play Core library enables in your applications. It will cover:\r\n* Why and how to start using AAB and dynamic delivery\r\nWhat is the Play Core library and how it interacts with dynamic delivery\r\n* On-demand delivery of additional modules and language resources\r\n* In app updates, covering blocking and non-blocking flows with some bonus  UX considerations\r\n\r\nWe’ll finish by looking at how you can use the new Internal App Sharing to distribute your test builds.\r\n",
              "startsAt": "2019-09-10T09:50:00",
              "endsAt": "2019-09-10T10:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e5941ea5-5a10-45a0-903b-f642db802a16",
                  "name": "Pietro Maggi"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "10:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "83e240e0-adcb-4766-a91b-5993a1b04f80",
              "title": "Coffee Break",
              "description": null,
              "startsAt": "2019-09-10T10:30:00",
              "endsAt": "2019-09-10T10:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "130657",
              "title": "Roasting Google APIs on a Firebase to Create Uberritos",
              "description": "This talk will help developers learn how to create an Uber like app within hours and zero lines of backend code, leveraging the capabilities of Firebase – a realtime database in the cloud as a data provider and Google Maps, Places and Directions APIs as a case study for the sample app.",
              "startsAt": "2019-09-10T10:50:00",
              "endsAt": "2019-09-10T11:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "03c63012-49c4-44eb-af96-0f5360b0d187",
                  "name": "Ishan Khanna"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "136502",
              "title": "App size reduction at Microsoft SwiftKey",
              "description": "We present our unofficial guide to Android app size and how to squeeze in as much useful functionality into your app in the smallest number of bytes. The SwiftKey team has managed to halve our download and install size by investigating the root causes of bloat as well as taking advantages of the latest developments in Android. We’ve done this whilst continuing to support over 350 languages, 200 themes, 200 keyboard layouts, handwriting recognition, translator, emoji prediction and loads more. ",
              "startsAt": "2019-09-10T10:50:00",
              "endsAt": "2019-09-10T11:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "bb7103dd-61b7-4586-a1f7-ad365f335e54",
                  "name": "Praveen Pendyala"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "11:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "70282a04-8dcb-4c99-82b5-4897e1a09d99",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T11:30:00",
              "endsAt": "2019-09-10T11:40:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "11:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "135785",
              "title": "MyTextUtils or how to lose your business in 1 line",
              "description": "Narrative:\r\n\r\nHey, I wrote a library which converts strings to upper case:\r\n\r\n    MyTextUtils.toUpperCase(\"Hello World!\");\r\n\r\nIt does what it says... and even more. Like stealing user's preferences, data from SQLite tables and sniffing all encrypted data.\r\n\r\nWe will start with an overview of what a 3rd party libraries can have access to, talk a little about annotation processing and finally see how we can try to protect ourselves from such risks.",
              "startsAt": "2019-09-10T11:40:00",
              "endsAt": "2019-09-10T12:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "de958717-8a6f-49ba-ba2f-3f1d65a13f66",
                  "name": "Dmitry Zaytsev"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "136759",
              "title": "Make some move with MotionLayout",
              "description": "Always wanted to build better animations ? Let’s explore Motion Layout in order to know its capabilities. MotionLayout beta-1 was release during the Google I/O. It promises to simplify the way we create animation on Android. Based on XML we will be able to describe on animation that could connected to a swipe on the screen or a native component.\r\n\r\nIn this talk, I will explore an Android app that list version of Android. For each version we will discover a new example, starting with basic modification of a constraint. Then adding KeyFrame with position, scale and rotation. Next playing with customs attributes to change the image color saturation. Lastly we will explore connection with Coordinator Layout, View Pager, Drawer and SeekBar.\r\n\r\nAt the end, you should know how to use and what are the capabilities of MotionLayout. Should you use it in your application ?\r\n\r\nWant to know more, you can read this article : https://medium.com/xebia-france/move-my-app-with-motionlayout-part-1-7800637feb22",
              "startsAt": "2019-09-10T11:40:00",
              "endsAt": "2019-09-10T12:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "cd3000b1-acb2-42bb-a656-037844d79383",
                  "name": "Alexandre Genet"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "12:20:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "a6db5b92-65bb-4eef-97af-f14afc28ab09",
              "title": "Lunch",
              "description": null,
              "startsAt": "2019-09-10T12:20:00",
              "endsAt": "2019-09-10T13:20:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "13:20:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "122404",
              "title": "RxJava & Coroutines: A Practical Analysis",
              "description": "Kotlin has taken the Android world by storm, and is quickly becoming the most popular language of choice. With Coroutines now stable, does it make sense to replace your RxJava implementations for Coroutines?\r\n\r\nDespite the hype, it may not make sense to jump on the bandwagon just yet. RxJava has already proven its stability and usefulness, and a comparison between the two frameworks shows that they are simply better suited for different purposes.\r\n\r\nIn this talk you’ll learn:\r\n- how to utilise the strengths of each framework\r\n- how to correctly choose the best solution for the requirements of your project\r\n- whether it may be beneficial to migrate or run them concurrently\r\n- and how you can start doing so for your project",
              "startsAt": "2019-09-10T13:20:00",
              "endsAt": "2019-09-10T14:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
                  "name": "Ash Davies"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "123604",
              "title": "Android Testing Strategy",
              "description": "Testing an Android application was always hard. In the past couple of years we got access to better tools, but we still rely a lot on architecture and design decisions in order to properly test an Android application. This talk will discuss the layers of automated testing an Android application should have, from End-to-end, Component, Integration to Unit tests. Also we will discuss BDD, TDD and Clean Architecture as tools to implement those layers.",
              "startsAt": "2019-09-10T13:20:00",
              "endsAt": "2019-09-10T14:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4497e030-9577-4439-a9d0-6cc6d165ff59",
                  "name": "Marcelo Benites"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "14:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "8ea58a18-ade3-49aa-b97f-c9a932486cd8",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T14:00:00",
              "endsAt": "2019-09-10T14:10:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "14:10:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "132911",
              "title": "Shrinking WhatsApp",
              "description": "Billions of people in over 180 countries use WhatsApp to stay in touch with friends and family. At WhatsApp we relentlessly work on shrinking our apk as much as possible given that many of our users live in regions with poor connectivity and we are committed to leave no one behind. In this session we will cover some of the wins, regressions, strategies and technologies that we use to tame WhatApp's apk size.",
              "startsAt": "2019-09-10T14:10:00",
              "endsAt": "2019-09-10T14:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "ad3f4881-1d23-4968-8838-b048c5d27e57",
                  "name": "Evelio Tarazona Cáceres"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "131746",
              "title": "Best of sign in experience",
              "description": "Have you ever thought about how often you have implemented login features in an app? As a user have you ever thought about how often you log in to those apps? The answer might be “pretty often”. Sometimes it relates to security like in banking app, sometimes it’s to be able to provide you with personalized content such as learning materials.  \r\n\r\nAs software engineers, we want to provide an easy and simple for users to log into apps. For first time users of an app, entering login details is the most annoying thing according to various articles.  The result of this is losing potential customers of an app. Thankfully, there are many different and easy ways to register and login nowadays. Google Sign-in, SmartLock or Autofill framework are only a few examples to achieve a better user experience. A few clicks – and voalá – you have a new user.   \r\n\r\nIn this talk, I want to share with you different ways to register and login to apps that result in less effort by the user. The topic will be interesting for engineers to discover how the quality of their products can be improved and learn how to achieve it on Android.  ",
              "startsAt": "2019-09-10T14:10:00",
              "endsAt": "2019-09-10T14:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "807318b3-6a4e-4568-b42c-24d184d54b06",
                  "name": "Dmytro Khmelenko"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "14:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "b007c029-dc81-472f-9fbd-2acd65c56967",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T14:50:00",
              "endsAt": "2019-09-10T15:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "15:00:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "123882",
              "title": "Navigation in Modular Applications with Deep Linking",
              "description": "Android engineering has come a long way. Nowadays most applications are modularized to a certain degree - to combat high compile times, enforce separation of concerns or to group code based on certain scopes.\r\n\r\nIn this talk we will take a look at navigation in modularized apps. Navigation in Android can be done explicitly by passing the class variable or implicit by sending an Intent with a certain configuration. Since modularization is supposed to simplify our dependency graph, we will take a closer look at deep linking as a navigation pattern and compare different approaches like Intent filter, a custom deeplink processor or the Android Jetpack Navigation component. \r\n\r\nAfter this talk, you will be able to modularize your application with a clean, structured and scalable navigation. ",
              "startsAt": "2019-09-10T15:00:00",
              "endsAt": "2019-09-10T15:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "0ee9d8ba-aed3-46f1-bf46-320dfb5cec43",
                  "name": "Damian Burke"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "134044",
              "title": "How to build a messenger for Android?",
              "description": "It looks so simple outside, the app which can send messages from one user and receive from others. This is what we were thinking from start. 9 months passed we're still on it. In this talk, I will go through the main parts of the messenger project such as transport, synchronization, architecture, storage, pagination as well as explain common mistakes we've made on the way to instant messenger. \r\n\r\nYou’ll leave this talk with a solid understanding of how modern messengers are built and the confidence to get started.\r\n",
              "startsAt": "2019-09-10T15:00:00",
              "endsAt": "2019-09-10T15:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "0500b7f7-51c4-4997-ba87-8b50a6a44ab4",
                  "name": "Andrii Rakhimov"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "15:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "d401e249-7432-4fa2-b388-190ea24b1394",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T15:40:00",
              "endsAt": "2019-09-10T15:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "15:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "143230",
              "title": "The Flutter Journey From a Personal App to a Successful Production App",
              "description": "In this talk, I'll explain the process of turning an idea into an app, building it, publishing and lessons learned along the way.\r\n\r\nThe app is 100% in Flutter and powered by Firebase. Thanks to the open source nature of the platform and external dependencies as well as features of the Dart programming language, the development of the app could be done very quickly. The app is currently in production and has 100+ daily active users.\r\n\r\nOther topics that will be covered include:\r\n- Material Design implementation on the Flutter framework\r\n- Resources (strings, styles) management\r\n- Properly managing crash reporting and handling the Flutter red screen of death\r\n- Localization\r\n- Creating flavors\r\n- Tips and common tasks done during development\r\n\r\nFinally, I'll talk about the power of the community and how your users can help you build a better product.",
              "startsAt": "2019-09-10T15:50:00",
              "endsAt": "2019-09-10T16:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
                  "name": "Elaine Dias Batista"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "135726",
              "title": "Secure Derivation of Passwords in Android",
              "description": "As Android developers, security matters in Android development. With the rapid growth of Android devices in the world, Security has never been as important as it is today, and it will never be an outdated subject.\r\nPasswords or passphrases created by humans are often short or predictable enough to allow password cracking. Taking some examples of several common attacks we will explain why using the password directly for encryption and authentification is risky. We will understand how Secure Derivation of Passwords can prevent password cracking. And most important, we will talk about what are the solutions on Android.\r\n\r\nIn this talk you will learn password security on Android:\r\n- Cryptographic knowledge about password cracking\r\n- What is the key derivation\r\n- Solutions for key derivation\r\n- How to improve password security on Android using Password-based key derivation functions?\r\n- What are the existing Android framework API solutions, the limitations, the improvements?\r\n- On Android, how to use modern password-based key derivation functions such as PBKDF2 and Argon2\r\n\r\nAndroid engineers interested in improving password security and understanding cryptographic in Android development are definitely recommended to come to this talk.",
              "startsAt": "2019-09-10T15:50:00",
              "endsAt": "2019-09-10T16:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "0cc865f0-2d9d-479d-b247-181ff5b8357a",
                  "name": "Xiaoyi Li"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "16:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "2c1daf56-a94f-4f99-8b5e-5eda2c3b406c",
              "title": "Coffee Break",
              "description": null,
              "startsAt": "2019-09-10T16:30:00",
              "endsAt": "2019-09-10T16:50:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "16:50:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "137048",
              "title": "I have no idea what my app is doing ¯\\_(ツ)_/¯",
              "description": "Do you exactly know what's your app doing when you deliver it to your users? Are you 100% sure? Would you bet on this? You're probably confident with the code you wrote and you know what is doing.\r\n\r\nBut what about the code that others wrote?\r\n\r\nWe pull dependencies from the online repositories every day. Our applications strongly rely on external libraries that are hosted on public Maven repositories. What if one of those library contains some malicious code? Imagine a library that starts harvesting your user data without you knowing it.\r\n\r\nIn this talk we will see how to monitor and protect your application from malicious dependency on the web that might end up in your final compiled App.",
              "startsAt": "2019-09-10T16:50:00",
              "endsAt": "2019-09-10T17:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8730d40b-3fb7-450d-ab71-08c9dd81a48a",
                  "name": "Nicola Corti"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "136448",
              "title": "Cut your APK size with features on demand",
              "description": "Do APK or app size matters?\r\nDoes a user think about the APK size before downloading it?\r\nDoes a user think about space, an app occupying on the phone?\r\nIs your App size is more than just a few MBs?\r\n\r\nWhat if we provide very basic functionality and let the user decide whether he wants the advanced or additional functionality or not?\r\n\r\nYes, The user thinks about the app size before downloading or updating an app which has a size larger than a few MBs. The user thinks about the data also over which he will be downloading or updating that app. He or she even think about how much space will it take on his or her device. In this fight of space in the device and size of the app, the apps having a smaller size and frequent utility wins the battle. \r\n\r\nWhat if we provide very basic functionality and let the user decide whether he wants the advanced or additional functionality or not. What if he or she can download only the features he needs on demand and keep the app compact. \r\n\r\nGoogle new feature of dynamic delivery enables us to deliver the features on demand. This helps us to reduce the size of APK and even enables the user to choose what features he needs. From a developers perspective, this is very easy to implement and maintain.\r\n\r\nEven we (Sharechat) were also at the same state where the size of APK was an issue with the new set of features we were trying to implement. Google Dynamic delivery came to the rescue.\r\n\r\nWhat is actually a dynamic delivery?\r\nHow can we reduce the APK size with it?\r\nHow it can help a user?\r\nHow to implement it in Android?\r\nHow difficult is it to implement in the existing code base?\r\nHow will it look to the user in the app?\r\n\r\nWell, let's get all these questions answered in the talk along with our experiences and challenges we faced.",
              "startsAt": "2019-09-10T16:50:00",
              "endsAt": "2019-09-10T17:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e3617ae8-580d-483d-9830-01a1ced6ecf2",
                  "name": "Suneet Agrawal"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "17:30:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "ee5e4924-5c4d-484d-a9ef-b691f7c14b9b",
              "title": "Break",
              "description": null,
              "startsAt": "2019-09-10T17:30:00",
              "endsAt": "2019-09-10T17:40:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "122403",
              "title": "Implementing the Paging Library",
              "description": "The Android Paging Library makes it easy to integrate complex paging behaviour, gradually loading small chunks of data at a time to help reduce usage of network bandwidth and system resources.\r\n\r\nThe library allows you to implement this behaviour using compositional components in a decoupled architecture making your code more reliable, scalable, and testable. Furthermore, you’ll be able to use familiar components such as LiveData or RxJava to interface with your existing architecture.\r\n\r\nIn this talk you’ll learn:\r\n- how to integrate the PagedList component into your architecture\r\n- how to implement a DataSource to load snapshots when necessary\r\n- how to use BoundaryCallback to signal the end of available data\r\n- how to integrate LiveData or RxJava to fit your project",
              "startsAt": "2019-09-10T17:40:00",
              "endsAt": "2019-09-10T18:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
                  "name": "Ash Davies"
                }
              ],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          },
          {
            "id": 5961,
            "name": "Pie",
            "session": {
              "id": "146273",
              "title": "NDK First Steps",
              "description": "Starting at NDK may not be easy sometimes so in this session it will be explained the basics of NDK, advantages and disadvantages. Additionally, it will be given an introduction on how to create a project with NDK and explained the main artefacts that are needed to connect NDK with the SDK.",
              "startsAt": "2019-09-10T17:40:00",
              "endsAt": "2019-09-10T18:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "9130eaf2-39ca-47f3-ac5d-c7be6cd9805d",
                  "name": "Jorge Mendes"
                }
              ],
              "categories": [],
              "roomId": 5961,
              "room": "Pie"
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "18:20:00",
        "rooms": [
          {
            "id": 5960,
            "name": "Oreo",
            "session": {
              "id": "840d58a2-7cbb-4136-9cef-4634ca49e496",
              "title": "See you next year",
              "description": null,
              "startsAt": "2019-09-10T18:20:00",
              "endsAt": "2019-09-10T18:40:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 5960,
              "room": "Oreo"
            },
            "index": 0
          }
        ]
      }
    ]
  }
]